{
    "HomePage": {
        "title": "Examen d'Éligibilité et de Stratégie de Visa",
        "subtitle": "Complétez cet entretien préliminaire pour recevoir votre VisaScore™ et une stratégie de demande personnalisée. Notre système alimenté par l'IA analyse votre profil par rapport aux tendances consulaires actuelles.",
        "devMode": "Mode Dev : Test de Génération PDF"
    },
    "Chat": {
        "title": "Assistant Consulaire",
        "secureId": "Système Automatisé Sécurisé • ID",
        "placeholder": "Tapez votre réponse ici...",
        "welcome": "Bienvenue au Centre de Traitement des Visas Américains. Je suis votre assistant consulaire automatisé. Pour commencer votre examen d'éligibilité, veuillez me dire : Quel est votre pays de citoyenneté ?",
        "error": "Je m'excuse, mais je rencontre actuellement des problèmes de connexion. Veuillez réessayer plus tard."
    },
    "Common": {
        "secureConnection": "Connexion SSL Sécurisée 256 bits",
        "secure": "Sécurisé",
        "downloadReport": "Télécharger un Exemple de Rapport",
        "generating": "Génération du Rapport...",
        "nav": {
            "home": "Accueil",
            "services": "Services",
            "about": "À Propos",
            "contact": "Contact",
            "start": "Commencer l'Évaluation"
        }
    },
    "Services": {
        "title": "Nos Services",
        "subtitle": "Advanced AI-powered tools to streamline your US Visa application process.",
        "analysisTitle": "AI Eligibility Analysis",
        "analysisDesc": "Our proprietary algorithm evaluates your profile against thousands of successful cases to determine your approval probability.",
        "strategyTitle": "Personalized Strategy",
        "strategyDesc": "Receive a custom PDF report with specific recommendations to strengthen your application before your interview.",
        "documentTitle": "Document Pre-Check",
        "documentDesc": "Identify missing or weak documentation that could lead to administrative processing delays."
    },
    "About": {
        "title": "À Propos",
        "missionTitle": "Our Mission",
        "missionDesc": "To democratize access to professional visa consulting through technology, providing accurate and accessible guidance to applicants worldwide.",
        "securityTitle": "Security First",
        "securityDesc": "We use bank-level 256-bit encryption to protect your personal data. Your information is never shared with third parties.",
        "disclaimerTitle": "Important Disclaimer",
        "disclaimerDesc": "US Visa Processing Center is a private technology company and is NOT affiliated with the United States Department of State or any government agency."
    },
    "Contact": {
        "title": "Contact Support",
        "desc": "Need assistance? Our support team is here to help with any technical issues regarding your assessment or report.",
        "email": "support@usvisaprocessingcenter.com"
    }
}